# Вычислить число π c заданной точностью d
# *Пример:* 

# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$

# РЕШЕНИЕ НЕ ВЕРНОЕ

# d = float(input("Введите число d: ")) 
# for i in range(1, 1000000):
#     d = d + 4 * ((-1) ** (i + 1)) / (2 * i -1)
# print(f"число Пи с заданной точностью равно {d}")

